Revit 2026 API

# RebarHandlesData Properties

---

The RebarHandlesData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

RebarHandlesData Class

Autodesk.Revit.DB.Structure Namespace